In [2]:
!uv pip install pandas
!uv pip install pandas sqlalchemy 
!uv pip install psycopg2-binary
!uv pip install python-dotenv

Audited 1 package in 17ms
Audited 2 packages in 14ms
Audited 1 package in 11ms
Resolved 1 package in 122ms
Installed 1 package in 11ms
 + python-dotenv==1.0.1

In [3]:
import pandas as pd
from sqlalchemy import create_engine
from dotenv import load_dotenv
import os

In [5]:
df = pd.read_csv('./data/dataset.csv')

In [6]:
df.head()

,invoice_no,customer_id,gender,age,category,quantity,price,payment_method,invoice_date,shopping_mall
0,I138884,C241288,Female,28,Clothing,5,1500.40,Credit Card,5/8/2022,Kanyon
1,I317333,C111565,Male,21,Shoes,3,1800.51,Debit Card,12/12/2021,Forum Istanbul
2,I127801,C266599,Male,20,Clothing,1,300.08,Cash,9/11/2021,Metrocity
3,I173702,C988172,Female,66,Shoes,5,3000.85,Credit Card,16/05/2021,Metropol AVM
4,I337046,C189076,Female,53,Books,4,60.60,Cash,24/10/2021,Kanyon

In [7]:
df.describe()

                age      quantity         price
count  99457.000000  99457.000000  99457.000000
mean      43.427089      3.003429    689.256321
std       14.990054      1.413025    941.184567
min       18.000000      1.000000      5.230000
25%       30.000000      2.000000     45.450000
50%       43.000000      3.000000    203.300000
75%       56.000000      4.000000   1200.320000
max       69.000000      5.000000   5250.000000

In [4]:
load_dotenv()

db_user = os.getenv("POSTGRES_USER")
db_password = os.getenv("POSTGRES_PASSWORD")
db_host = os.getenv("POSTGRES_HOST")
db_port = os.getenv("POSTGRES_PORT")
db_name = os.getenv("POSTGRES_DB")

In [7]:
connection_string = f"postgresql://{db_user}:{db_password}@{db_host}:{db_port}/{db_name}"
engine = create_engine(connection_string)

In [8]:
try:
    with engine.connect() as conexion:
        print("¡Conexión exitosa!")
except Exception as e:
    print("Error al conectar a la base de datos:", e)

¡Conexión exitosa!

In [10]:
table =  'basic_table'

In [11]:
df.to_sql(table, engine, if_exists='replace', index='False')

457